In [75]:
# 270p line 10
import pandas as pd
import numpy as np
string_data = pd.Series(["a","b", np.nan,"d"])
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.isnull()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [8]:
# na값을 전부 없애줌
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
#272ㅔ line 19
from numpy import nan as NA
data = pd.DataFrame([[1., 6.5, 3.],[1., NA, NA],[NA, NA, NA],[NA, 6.5, 3.]])

In [17]:
data = pd.DataFrame([[1., 6.5, 3.],[1., NA, NA],[NA, NA, NA],[NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
# 너무 다 없어짐
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [20]:
#
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
#NaN값을 다 소거하면 남는 데이터가 없으니 
#threshold 를 사용 (문턱값)
#직접 인수를 설정하던지 아니면 A.I가 자동으로

In [25]:
# 275p line 35 
df2 = df.fillna(0)
df2
_ = df.fillna(0, inplace=True) #원본의 NA가 0대체 즉 새로운 df를 안 만듦

NameError: name 'df' is not defined

In [ ]:
# p276 표7-2
# method ffill 
# line 40

In [26]:
dic_data = {"k1":['one', 'two', 'one', 'two', 'one', 'two', 'two',],
           "k2":[1, 1, 2, 3, 4, 4, 4]}
data = pd.DataFrame(dic_data)
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   4
5  two   4
6  two   4

In [27]:
#중복확인
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [28]:
# 중복된거 없애기
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   4
5  two   4

In [31]:
#컬럼추가
data['v1'] = [0,1,2,3,4,5,6]
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   4   4
5  two   4   5
6  two   4   6

In [32]:
#
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
#마지막 생성되는 값에 비중을 둔다
data.drop_duplicates(['k1','k2'], keep ='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   4   4
6  two   4   6

In [34]:
# 처음생성되었던 값에 비중을 둠
data.drop_duplicates(['k1','k2'], keep ='first')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   4   4
5  two   4   5

In [ ]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'pastrami', 'corned beef', 'bacon', ]})

In [35]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [36]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [38]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [39]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [41]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [48]:
import re
text = "foo bar\t baz \tqux"
print(text)

foo bar	 baz 	qux

In [49]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [51]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [52]:
regex.findall(text)

[' ', '\t ', ' \t']

In [54]:
text = """Dave dave@google.com
Steve steve@google.com
Rob rob@google.com
Ryan ryan@google.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9._%+-]+.[A-Z]{2,4}'
re1 = re.compile(pattern, flags=re.IGNORECASE)

In [47]:
re1.findall(text)

['dave@google.com', 'steve@google.com', 'rob@google.com', 'ryan@google.com']

In [55]:
regex.findall(text)

[' ', '\n', ' ', '\n', ' ', '\n', ' ', '\n']

In [59]:
data = pd.Series(np.random.randn(9),
                index=[['a','a','a', 'b','b', 'c','c','d','d'],
                       [1, 2, 3,      1,  2,   1,  2,  1,  2]])

In [61]:
data['b']

1    0.148168
2   -0.775062
dtype: float64

In [62]:
data.loc[['b','d']]

b  1    0.148168
   2   -0.775062
d  1   -0.881184
   2   -0.321345
dtype: float64

In [63]:
data.loc['b',2]

-0.7750617027668799

In [87]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','a','b'],
                    'data1':[0, 1, 2, 3, 4, 5, 6]})
df2 = pd.DataFrame({'key':['a', 'b', 'd'],
                    'data2':[0, 1, 2]})

In [88]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [92]:
df3 = pd.DataFrame({'l_key':['b','b','a','c','a','a','b'],
                    'data3':[0, 1, 2, 3, 4, 5, 6]})
df4 = pd.DataFrame({'r_key':['a', 'b', 'd'],
                    'data4':[0, 1, 2]})

In [94]:
pd.merge(df3, df4, left_on='l_key', right_on='r_key')

  l_key  data3 r_key  data4
0     b      0     b      1
1     b      1     b      1
2     b      6     b      1
3     a      2     a      0
4     a      4     a      0
5     a      5     a      0

In [100]:
left1 = pd.DataFrame({'key':['a','b','a','a','b','c'],
                     'value':range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]},
                     'index' = ['a','b'])

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (<ipython-input-100-7ef50425c6b9>, line 4)

In [96]:

# 딱히 key로 잡을게 없다 그러면 행 번호로 키로 잡을 수 있음
pd.merge(left1, right1, left_on='key', right_index=True)

NameError: name 'left1' is not defined

In [108]:
#concat
import numpy as np
arr = np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [102]:
np.concatenate([arr, arr])

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [115]:
np.concat([arr. arr], axis=0)

AttributeError: module 'numpy' has no attribute 'concat'

In [110]:
s1 = pd.Series([0,1], index=["a", 'b'])
s2 = pd.Series([2,3,4], index=["c", 'd','e'])
s3 = pd.Series([5,6], index=["f", 'g'])
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [114]:
pd.concat([s1,s2,s3], axis=0)

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [117]:
df1 = pd.DataFrame(np.random.randn(3,4), columns=['a','b','c','d'])
df2 = pd.DataFrame(np.random.randn(2,3), columns=['b','d','a'])

In [118]:
pd.concat([df1, df2])

          a         b         c         d
0 -0.022125 -0.297593  0.734910 -0.485602
1 -0.261759 -1.270012  0.907425 -0.782094
2 -1.307695  0.410943  0.756240 -1.226573
0  0.203707  0.250762       NaN -0.285810
1 -0.148145 -0.248287       NaN  0.943329

In [120]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0 -0.022125 -0.297593  0.734910 -0.485602
1 -0.261759 -1.270012  0.907425 -0.782094
2 -1.307695  0.410943  0.756240 -1.226573
3  0.203707  0.250762       NaN -0.285810
4 -0.148145 -0.248287       NaN  0.943329

In [121]:
# 시계열 데이터
from datetime import datetime

In [124]:
now = datetime.now()
now

datetime.datetime(2021, 6, 2, 15, 50, 38, 841347)

In [126]:
now.year, now.month, now.day

(2021, 6, 2)

In [128]:
# datetime은 날짜와 시간을 모두 저장하면 마이크로초까지 지원
# datetime.timedelta 는 두 datetime 객체 간의 시간적인 차이를 표현 할 수 있다

delta = datetime(2011, 1, 7) - datetime(2008, 6, 24, 8, 15)
delta

datetime.timedelta(days=926, seconds=56700)

In [ ]:
ts = pd.Series(np.arange)

In [129]:
# 총 받은 데이터수 
ts.resample('5min', closed='right').sum()

NameError: name 'ts' is not defined

In [ ]:
# 5분당 받은 데이터 수
ts.resample('5min', closed='right').mean()